{
  "irVersion": "1.0",
  "project": "omni-twilio",
  "repository": "https://github.com/plexusone/omni-twilio",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-04-18",
      "highlights": [
        { "description": "**Breaking**: Rename from omnivoice-twilio to twilio-go" },
        { "description": "Add OmniChat SMS provider for omnichat integration" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/plexusone/omnivoice-twilio` to `github.com/plexusone/omni-twilio`", "commit": "932a039" },
        { "description": "**Breaking**: OmniVoice providers moved to `omnivoice/` subdirectory", "commit": "932a039" }
      ],
      "added": [
        { "description": "Exported Twilio REST client at `client/` package (previously internal)", "commit": "932a039" },
        { "description": "OmniChat SMS provider implementing `provider.Provider` interface", "commit": "932a039" },
        { "description": "Webhook handler for receiving inbound SMS via Twilio webhooks", "commit": "932a039" }
      ],
      "fixed": [
        { "description": "Update import paths after rename", "commit": "f80eddc" },
        { "description": "Resolve G120 gosec lint errors with `http.MaxBytesReader`", "commit": "4d80842" },
        { "description": "Fix gofmt formatting", "commit": "b197bd6" }
      ],
      "documentation": [
        { "description": "Update README with new package structure and examples", "commit": "91c4df1" },
        { "description": "Update badge URLs to twilio-go", "commit": "91c4df1" }
      ],
      "build": [
        { "description": "Update LICENSE years", "commit": "16f0abb" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/twilio/twilio-go` from 1.30.4 to 1.30.5", "commit": "4405e2f" }
      ]
    },
    {
      "version": "v0.3.1",
      "date": "2026-04-01",
      "dependencies": [
        { "description": "Bump `github.com/plexusone/omnivoice-core` to v0.7.0", "commit": "ad6932a" },
        { "description": "Bump `github.com/twilio/twilio-go` from 1.30.3 to 1.30.4", "commit": "3b25002" },
        { "description": "Update Go module dependencies", "commit": "b02de48" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-03-22",
      "highlights": [
        { "description": "SMS messaging support via SMSProvider interface" }
      ],
      "added": [
        { "description": "`SendSMS` and `SendSMSFrom` methods on CallSystem Provider", "commit": "025ff35" },
        { "description": "Provider now implements `callsystem.SMSProvider` interface", "commit": "025ff35" },
        { "description": "`Message` type and `SendSMS` on internal Twilio client", "commit": "025ff35" }
      ],
      "documentation": [
        { "description": "Add SMS usage example to README", "commit": "e341efb" },
        { "description": "Add UTF-8 icons to Features section", "commit": "e341efb" },
        { "description": "Update import paths from agentplexus to plexusone", "commit": "e341efb" }
      ],
      "build": [
        { "description": "Update to shared CI workflow files", "commit": "b643794" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/twilio/twilio-go` from 1.30.2 to 1.30.3", "commit": "fced0f9" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/agentplexus/omnivoice-twilio` to `github.com/plexusone/omnivoice-twilio`", "commit": "be76a45" }
      ],
      "tests": [
        { "description": "Add conformance tests for CallSystem, STT, TTS, and Transport providers", "commit": "be76a45" }
      ],
      "dependencies": [
        { "description": "Update to `github.com/plexusone/omnivoice-core` v0.5.0 (was agentplexus/omnivoice)", "commit": "be76a45" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2026-01-18",
      "changed": [
        {
          "description": "Internal: switch to official twilio-go SDK, replacing custom HTTP client implementation",
          "commit": "57f016899c3bb8616f2b088a529574790767ed91"
        }
      ],
      "dependencies": [
        {
          "description": "Add `github.com/twilio/twilio-go` v1.29.1",
          "commit": "57f016899c3bb8616f2b088a529574790767ed91"
        }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-28",
      "added": [
        {
          "description": "Initial omnivoice-twilio provider implementation",
          "commit": "b8fc59dd8a3aa1e1641bc9d66385d491a346a2bf"
        },
        {
          "description": "Twilio client with `MakeCall`, `GetCall`, `UpdateCall`, `HangupCall`, `ListPhoneNumbers` methods",
          "commit": "b8fc59dd8a3aa1e1641bc9d66385d491a346a2bf"
        },
        {
          "description": "WebSocket transport for Twilio Media Streams",
          "commit": "b8fc59dd8a3aa1e1641bc9d66385d491a346a2bf"
        },
        {
          "description": "Call system integration with omnivoice interfaces",
          "commit": "b8fc59dd8a3aa1e1641bc9d66385d491a346a2bf"
        }
      ],
      "documentation": [
        {
          "description": "Add README with badges",
          "commit": "7e19015af649f043d96d5a068285b8abf6966f98"
        }
      ],
      "build": [
        {
          "description": "Add CI workflows, gitignore, and license",
          "commit": "83b9572f33197f6a0cf81026f1f5c3f3eebaebb3"
        },
        {
          "description": "Update Go versions in go.mod",
          "commit": "edea6dfdf0c71344961f0f662ff1f153169f1524"
        },
        {
          "description": "Update Go dependencies",
          "commit": "555cb543185526f1a538ecd2ed3fcb0678dc8bdf"
        }
      ],
      "fixed": [
        {
          "description": "Fix struct and const field alignment",
          "commit": "431bfc509bd9fcebf8f74cc210b111a194c964e0"
        }
      ]
    }
  ]
}
